# 1. FROM: Указываем базовый образ. Мы не собираем ОС с нуля.
# Мы берем легковесный образ Linux (Debian) с уже установленным Python 3.11
FROM python:3.11-slim

# 2. WORKDIR: Создаем рабочую директорию внутри контейнера и переходим в нее (аналог mkdir + cd)
WORKDIR /usr/src/myapp

# 3. COPY: Копируем файлы с нашего хоста (ноутбука) внутрь контейнера.
# Синтаксис: COPY <что_на_хосте> <куда_в_контейнере>
# Точка означает "все файлы из текущей папки хоста в текущую WORKDIR контейнера"
COPY . .

# 4. CMD: Какую команду выполнить, когда контейнер стартует? (аналог ввода в bash)
CMD ["python", "app.py"]